<div class="panel panel-info"> 
<div class="panel-heading"> 
<h3 class="panel-title">
<center><h3>3204-2005 การออกแบบและพัฒนาเว็บไซต์</h3></center>
</h3> 
</div> 
<div class="panel-body">
<b>จุดประสงค์รายวิชา เพื่อให้</b>
<ul>
<li>เข้าใจเกี่ยวกับหลักการออกแบบเว็บไซต์</li>
<li>มีทักษะในการประยุกต์ใช้โปรแกรมการสร้างเว็บไซต์</li>
<li>มีคุณลักษณะนิสัยที่พึงประสงค์ และเจตคติที่ดีในวิชาชีพคอมพิวเตอร์ธุรกิจ</li>
 </ul>
<br><br>
<b>สมรรถนะรายวิชา</b>
<ul>
<li>แสดงความรู้เกี่ยวกับหลักการออกแบบและพัฒนาเว็บไซต์</li>
<li>ออกแบบและพัฒนาเว็บไซต์ในงานธุรกิจ</li>
</ul> 
<br><br>

<b>คำอธิบายรายวิชา</b><br>
<ul>
<li>ศึกษา และปฏิบัติเกี่ยวกับหลักการออกแบบเว็บไซต์ในงานธุรกิจ การใช้สี การใช้ตัวอักษร การใช้รูปภาพ การออกแบบกราฟิกและภาพเคลื่อนไหวสำหรับเว็บไซต์ ระบบนำทางเว็บ (Navigation) ส่วนติดต่อผู้ใช้ (User Interface) แม่แบบเอกสารเว็บ สร้างเว็บไซต์ กรณีศึกษา</li>
</ul>
<br><br>

<b>ขั้นตอนการออกแบบและพัฒนาเว็บไซต์</b><br>
<ul>
<li>ออกแบบฐานข้อมูล (Data dictionary)</li>
<li>ออกแบบ Site map</li>
<li>ออกแบบหน้าเว็บเพจ</li>
<li>จัดทำฐานข้อมูลในโปรแกรม</li>
<li>สร้างไซต์ Site และเชื่อมต่อกับฐานข้อมูล</li>
<li>สร้างหน้าเว็บเพจ</li>
<li>อัพโหลดเว็บไซต์</li>
</ul>

 </div> 
 </div>